# GetWSImgUseLayScale

## Description
Determines if the image size type is Layer Scale.

```pascal
FUNCTION GetWSImgUseLayScale(
				worksheet : HANDLE;
				row       : INTEGER;
				column    : INTEGER) : BOOLEAN;
```

```python

def vs.GetWSImgUseLayScale(worksheet, row, column):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|worksheet|HANDLE|The worksheet handle.|
|row|INTEGER|The cell row.|
|column|INTEGER|The cell column.|

## Returns
BOOLEAN indicating if state of cell's use layer scale.

## Version
Availability: from Vectorworks 2014
## Category
* Worksheets